# Data Frame

In [25]:
import numpy as np
import pandas as pd

In [26]:
data = np.random.randn(4,3)

In [27]:
data

array([[-0.54740473, -1.68540908, -1.27995991],
       [ 1.0837703 ,  2.08337395, -0.98591493],
       [ 0.51252782,  0.37433492,  0.75628741],
       [-0.36738474, -1.26636018,  1.66824697]])

In [28]:
dataFrame = pd.DataFrame(data)

In [29]:
dataFrame

          0         1         2
0 -0.547405 -1.685409 -1.279960
1  1.083770  2.083374 -0.985915
2  0.512528  0.374335  0.756287
3 -0.367385 -1.266360  1.668247

In [30]:
type(dataFrame[0])

pandas.core.series.Series

In [31]:
yeniDataFrame = pd.DataFrame(data,index=["Emir" ,"Ayşe" , "Zeynep" ,"Kürşad"] , columns=["Maaş", "Yaş" , "Çalışma Saati"])

In [32]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati
Emir   -0.547405 -1.685409      -1.279960
Ayşe    1.083770  2.083374      -0.985915
Zeynep  0.512528  0.374335       0.756287
Kürşad -0.367385 -1.266360       1.668247

In [33]:
yeniDataFrame["Maaş"]

Emir     -0.547405
Ayşe      1.083770
Zeynep    0.512528
Kürşad   -0.367385
Name: Maaş, dtype: float64

In [34]:
yeniDataFrame[["Maaş" , "Yaş"]]

            Maaş       Yaş
Emir   -0.547405 -1.685409
Ayşe    1.083770  2.083374
Zeynep  0.512528  0.374335
Kürşad -0.367385 -1.266360

In [35]:
yeniDataFrame.loc["Emir"]

Maaş            -0.547405
Yaş             -1.685409
Çalışma Saati   -1.279960
Name: Emir, dtype: float64

In [36]:
yeniDataFrame.iloc[1]

Maaş             1.083770
Yaş              2.083374
Çalışma Saati   -0.985915
Name: Ayşe, dtype: float64

In [37]:
yeniDataFrame["Emeklilik Yaşı"] = yeniDataFrame["Yaş"] + yeniDataFrame["Yaş"]

In [38]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati  Emeklilik Yaşı
Emir   -0.547405 -1.685409      -1.279960       -3.370818
Ayşe    1.083770  2.083374      -0.985915        4.166748
Zeynep  0.512528  0.374335       0.756287        0.748670
Kürşad -0.367385 -1.266360       1.668247       -2.532720

In [39]:
yeniDataFrame.drop("Emeklilik Yaşı",axis=1)

            Maaş       Yaş  Çalışma Saati
Emir   -0.547405 -1.685409      -1.279960
Ayşe    1.083770  2.083374      -0.985915
Zeynep  0.512528  0.374335       0.756287
Kürşad -0.367385 -1.266360       1.668247

In [40]:
yeniDataFrame.drop("Kürşad",axis=0)

            Maaş       Yaş  Çalışma Saati  Emeklilik Yaşı
Emir   -0.547405 -1.685409      -1.279960       -3.370818
Ayşe    1.083770  2.083374      -0.985915        4.166748
Zeynep  0.512528  0.374335       0.756287        0.748670

In [41]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati  Emeklilik Yaşı
Emir   -0.547405 -1.685409      -1.279960       -3.370818
Ayşe    1.083770  2.083374      -0.985915        4.166748
Zeynep  0.512528  0.374335       0.756287        0.748670
Kürşad -0.367385 -1.266360       1.668247       -2.532720

In [42]:
yeniDataFrame.drop("Emeklilik Yaşı" , axis=1 , inplace=True) ##Yapılan değişikliğin geçerli olması için inplace = True olmalı

In [43]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati
Emir   -0.547405 -1.685409      -1.279960
Ayşe    1.083770  2.083374      -0.985915
Zeynep  0.512528  0.374335       0.756287
Kürşad -0.367385 -1.266360       1.668247

In [45]:
yeniDataFrame.loc["Emir"]

Maaş            -0.547405
Yaş             -1.685409
Çalışma Saati   -1.279960
Name: Emir, dtype: float64

In [47]:
yeniDataFrame.loc["Emir","Yaş"]

-1.6854090824815322

In [49]:
booleanFrame = yeniDataFrame < 0

In [50]:
yeniDataFrame[booleanFrame]

            Maaş       Yaş  Çalışma Saati
Emir   -0.547405 -1.685409      -1.279960
Ayşe         NaN       NaN      -0.985915
Zeynep       NaN       NaN            NaN
Kürşad -0.367385 -1.266360            NaN

In [51]:
yeniDataFrame[yeniDataFrame["Yaş"]>0]

            Maaş       Yaş  Çalışma Saati
Ayşe    1.083770  2.083374      -0.985915
Zeynep  0.512528  0.374335       0.756287

In [52]:
yeniDataFrame.reset_index()

    index      Maaş       Yaş  Çalışma Saati
0    Emir -0.547405 -1.685409      -1.279960
1    Ayşe  1.083770  2.083374      -0.985915
2  Zeynep  0.512528  0.374335       0.756287
3  Kürşad -0.367385 -1.266360       1.668247

In [53]:
yeniIndexListesi = ["A","B","C","D"]

In [54]:
yeniDataFrame["Yeni İndex"] = yeniIndexListesi

In [55]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati Yeni İndex
Emir   -0.547405 -1.685409      -1.279960          A
Ayşe    1.083770  2.083374      -0.985915          B
Zeynep  0.512528  0.374335       0.756287          C
Kürşad -0.367385 -1.266360       1.668247          D

In [56]:
yeniDataFrame.set_index("Yeni İndex")

                Maaş       Yaş  Çalışma Saati
Yeni İndex
A          -0.547405 -1.685409      -1.279960
B           1.083770  2.083374      -0.985915
C           0.512528  0.374335       0.756287
D          -0.367385 -1.266360       1.668247

In [57]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati Yeni İndex
Emir   -0.547405 -1.685409      -1.279960          A
Ayşe    1.083770  2.083374      -0.985915          B
Zeynep  0.512528  0.374335       0.756287          C
Kürşad -0.367385 -1.266360       1.668247          D

In [58]:
yeniDataFrame.set_index("Yeni İndex",inplace=True)

In [59]:
yeniDataFrame

                Maaş       Yaş  Çalışma Saati
Yeni İndex
A          -0.547405 -1.685409      -1.279960
B           1.083770  2.083374      -0.985915
C           0.512528  0.374335       0.756287
D          -0.367385 -1.266360       1.668247

In [61]:
yeniDataFrame.loc["A"]

Maaş            -0.547405
Yaş             -1.685409
Çalışma Saati   -1.279960
Name: A, dtype: float64

In [62]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [63]:
icIndeksler = ["Homer" , "Bart" , "Marge" , "Cartman" , "Kenny" , "Kyle"]

In [64]:
birlesmisIndeksler = list(zip(ilkIndeksler,icIndeksler))

In [65]:
birlesmisIndeksler

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [66]:
birlesmisIndeksler = pd.MultiIndex.from_tuples(birlesmisIndeksler)

In [67]:
birlesmisIndeksler

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [68]:
benimCizgiFilmlistem = [[1,"A"] , [2,"B"] , [3,"C"] , [4,"D"] , [5,"E"] , [6,"F"]]

In [69]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmlistem)

In [70]:
cizgiFilmNumpyDizisi

array([['1', 'A'],
       ['2', 'B'],
       ['3', 'C'],
       ['4', 'D'],
       ['5', 'E'],
       ['6', 'F']], dtype='<U11')

In [73]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndeksler,columns=["Yaş" , "Meslek"])

In [74]:
cizgiFilmDataFrame

                   Yaş Meslek
Simpson    Homer     1      A
           Bart      2      B
           Marge     3      C
South Park Cartman   4      D
           Kenny     5      E
           Kyle      6      F

In [76]:
cizgiFilmDataFrame.loc["Simpson"]

      Yaş Meslek
Homer   1      A
Bart    2      B
Marge   3      C

In [77]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yaş       5
Meslek    E
Name: Kenny, dtype: object

In [78]:
cizgiFilmDataFrame.index.names = ["Film","İsim"]

In [79]:
cizgiFilmDataFrame

                   Yaş Meslek
Film       İsim
Simpson    Homer     1      A
           Bart      2      B
           Marge     3      C
South Park Cartman   4      D
           Kenny     5      E
           Kyle      6      F

In [82]:
sozlukVerisi = {"Istanbul" : [10,np.nan,30] , "Ankara" : [5,10,np.nan], "İzmir" : [1,2,3]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [83]:
havaDurumuDataFrame

   Istanbul  Ankara  İzmir
0      10.0     5.0      1
1       NaN    10.0      2
2      30.0     NaN      3

In [84]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  İzmir
0      10.0     5.0      1

In [85]:
havaDurumuDataFrame.dropna(axis=1)

   İzmir
0      1
1      2
2      3

In [86]:
yeniSozlukVerisi = {"Istanbul" : [10,np.nan,30] , "Ankara" : [5,10,np.nan], "İzmir" : [1,2,3],"Antalya":[45,np.nan,np.nan]}
yeniHavaDurumuDataFrame = pd.DataFrame(yeniSozlukVerisi)

In [87]:
yeniHavaDurumuDataFrame

   Istanbul  Ankara  İzmir  Antalya
0      10.0     5.0      1     45.0
1       NaN    10.0      2      NaN
2      30.0     NaN      3      NaN

In [88]:
yeniHavaDurumuDataFrame.dropna(axis=1,thresh=2)

   Istanbul  Ankara  İzmir
0      10.0     5.0      1
1       NaN    10.0      2
2      30.0     NaN      3

In [89]:
yeniHavaDurumuDataFrame.fillna(20)

   Istanbul  Ankara  İzmir  Antalya
0      10.0     5.0      1     45.0
1      20.0    10.0      2     20.0
2      30.0    20.0      3     20.0

## groupby

In [91]:
maasSozluk = {
                "Departman":["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
                "Calisan Ismi":["Ali","Ayse","Emir","Fatma","Zeynep","Aybuke"],
                "Maas" : [100,200,300,400,500,600]
}

In [92]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [93]:
maasDataFrame

   Departman Calisan Ismi  Maas
0    Yazılım          Ali   100
1    Yazılım         Ayse   200
2  Pazarlama         Emir   300
3  Pazarlama        Fatma   400
4      Hukuk       Zeynep   500
5      Hukuk       Aybuke   600

In [94]:
grupObjesi = maasDataFrame.groupby("Departman")

In [95]:
grupObjesi.count()

           Calisan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [98]:
grupObjesi.mean("Departman")

            Maas
Departman
Hukuk      550.0
Pazarlama  350.0
Yazılım    150.0

In [99]:
grupObjesi.max()

          Calisan Ismi  Maas
Departman
Hukuk           Zeynep   600
Pazarlama        Fatma   400
Yazılım           Ayse   200

In [100]:
grupObjesi.min()

          Calisan Ismi  Maas
Departman
Hukuk           Aybuke   500
Pazarlama         Emir   300
Yazılım            Ali   100

In [101]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
Pazarlama   2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
Yazılım     2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0